; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v12 ?v9)
             (pred_12 ?v6 ?v5)
             (pred_2 ?v12 ?v5)
             (pred_6 ?v3 ?v12 )
	     (pred_8 ?v12)
             (pred_9 ?v8)
             (pred_7 ?v6)
             (pred_4 ?v5)
             (pred_5 ?v12)
             (pred_10 ?v6)
             (pred_3 ?v12)
             (pred_11 ))



(:action op_4
:parameters (?v4 ?v1 ?v11 ?v2)
:precondition (and (pred_9 ?v4) (pred_9 ?v1) (pred_7 ?v11) (pred_4 ?v2)
          (pred_1 ?v4 ?v1) (pred_12 ?v11 ?v2)
                   (pred_2 ?v1 ?v2) (pred_8 ?v4) 
                   (pred_5 ?v1) (pred_10 ?v11))
:effect (and  (pred_3 ?v1) (not (pred_5 ?v1))))


(:action op_5
:parameters (?v4 ?v10)
:precondition (and (pred_9 ?v4) (pred_9 ?v10)
               (pred_8 ?v4) (pred_1 ?v4 ?v10) (pred_3 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v4))))

(:action op_3
:parameters (?v4 ?v11)
:precondition (and (pred_9 ?v4) (pred_7 ?v11) 
                  (pred_8 ?v4) (pred_6 ?v11 ?v4) (pred_11 ))
:effect (and (pred_10 ?v11)
   (not (pred_6 ?v11 ?v4)) (not (pred_11 ))))


(:action op_2
:parameters (?v4 ?v7 ?v13)
:precondition (and (pred_9 ?v4) (pred_7 ?v7) (pred_7 ?v13)
                  (pred_8 ?v4) (pred_10 ?v13) (pred_6 ?v7 ?v4))
:effect (and (pred_10 ?v7) (pred_6 ?v13 ?v4)
        (not (pred_10 ?v13)) (not (pred_6 ?v7 ?v4))))

(:action op_1
:parameters (?v4 ?v11)
:precondition (and (pred_9 ?v4) (pred_7 ?v11) 
                  (pred_8 ?v4) (pred_10 ?v11))
:effect (and (pred_11 ) (pred_6 ?v11 ?v4) (not (pred_10 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_16 obj_22 obj_05 obj_14 obj_04 obj_03 obj_30 obj_18 obj_08 obj_10 obj_24 obj_21 obj_13 obj_15 obj_01 obj_20 obj_26 obj_29 obj_09 obj_27 obj_02 obj_07 obj_11 obj_28
    obj_06 obj_23
    obj_25 obj_17 obj_19
    )

    (:init
       (pred_11)

       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_22)
       (pred_9 obj_05)
       (pred_9 obj_14)
       (pred_9 obj_04)
       (pred_9 obj_03)
       (pred_9 obj_30)
       (pred_9 obj_18)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_9 obj_24)
       (pred_9 obj_21)
       (pred_9 obj_13)
       (pred_9 obj_15)
       (pred_9 obj_01)
       (pred_9 obj_20)
       (pred_9 obj_26)
       (pred_9 obj_29)
       (pred_9 obj_09)
       (pred_9 obj_27)
       (pred_9 obj_02)
       (pred_9 obj_07)
       (pred_9 obj_11)
       (pred_9 obj_28)
       (pred_4 obj_06)
       (pred_4 obj_23)
       (pred_7 obj_25)
       (pred_7 obj_17)
       (pred_7 obj_19)

       (pred_1 obj_12 obj_04)
       (pred_1 obj_12 obj_16)
       (pred_1 obj_16 obj_03)
       (pred_1 obj_16 obj_22)
       (pred_1 obj_16 obj_12)
       (pred_1 obj_22 obj_30)
       (pred_1 obj_22 obj_05)
       (pred_1 obj_22 obj_16)
       (pred_1 obj_05 obj_18)
       (pred_1 obj_05 obj_14)
       (pred_1 obj_05 obj_22)
       (pred_1 obj_14 obj_08)
       (pred_1 obj_14 obj_05)
       (pred_1 obj_04 obj_10)
       (pred_1 obj_04 obj_03)
       (pred_1 obj_04 obj_12)
       (pred_1 obj_03 obj_24)
       (pred_1 obj_03 obj_30)
       (pred_1 obj_03 obj_16)
       (pred_1 obj_03 obj_04)
       (pred_1 obj_30 obj_21)
       (pred_1 obj_30 obj_18)
       (pred_1 obj_30 obj_22)
       (pred_1 obj_30 obj_03)
       (pred_1 obj_18 obj_13)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_18 obj_05)
       (pred_1 obj_18 obj_30)
       (pred_1 obj_08 obj_15)
       (pred_1 obj_08 obj_14)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_10 obj_01)
       (pred_1 obj_10 obj_24)
       (pred_1 obj_10 obj_04)
       (pred_1 obj_24 obj_20)
       (pred_1 obj_24 obj_21)
       (pred_1 obj_24 obj_03)
       (pred_1 obj_24 obj_10)
       (pred_1 obj_21 obj_26)
       (pred_1 obj_21 obj_13)
       (pred_1 obj_21 obj_30)
       (pred_1 obj_21 obj_24)
       (pred_1 obj_13 obj_29)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_13 obj_21)
       (pred_1 obj_15 obj_09)
       (pred_1 obj_15 obj_08)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_01 obj_27)
       (pred_1 obj_01 obj_20)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_20 obj_02)
       (pred_1 obj_20 obj_26)
       (pred_1 obj_20 obj_24)
       (pred_1 obj_20 obj_01)
       (pred_1 obj_26 obj_07)
       (pred_1 obj_26 obj_29)
       (pred_1 obj_26 obj_21)
       (pred_1 obj_26 obj_20)
       (pred_1 obj_29 obj_11)
       (pred_1 obj_29 obj_09)
       (pred_1 obj_29 obj_13)
       (pred_1 obj_29 obj_26)
       (pred_1 obj_09 obj_28)
       (pred_1 obj_09 obj_15)
       (pred_1 obj_09 obj_29)
       (pred_1 obj_27 obj_02)
       (pred_1 obj_27 obj_01)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_02 obj_20)
       (pred_1 obj_02 obj_27)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_07 obj_26)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_11 obj_28)
       (pred_1 obj_11 obj_29)
       (pred_1 obj_11 obj_07)
       (pred_1 obj_28 obj_09)
       (pred_1 obj_28 obj_11)
       (pred_5 obj_15)
       (pred_5 obj_11)
       (pred_5 obj_28)
       (pred_2  obj_15 obj_06)
       (pred_2  obj_11 obj_23)
       (pred_2  obj_28 obj_23)
       (pred_3 obj_12)
       (pred_3 obj_16)
       (pred_3 obj_22)
       (pred_3 obj_05)
       (pred_3 obj_14)
       (pred_3 obj_04)
       (pred_3 obj_03)
       (pred_3 obj_30)
       (pred_3 obj_18)
       (pred_3 obj_08)
       (pred_3 obj_10)
       (pred_3 obj_24)
       (pred_3 obj_21)
       (pred_3 obj_13)
       (pred_3 obj_01)
       (pred_3 obj_20)
       (pred_3 obj_26)
       (pred_3 obj_29)
       (pred_3 obj_09)
       (pred_3 obj_27)
       (pred_3 obj_02)
       (pred_3 obj_07)

       (pred_12  obj_25 obj_06)
       (pred_12  obj_17 obj_23)
       (pred_12  obj_19 obj_23)
       (pred_6 obj_25 obj_02)
       (pred_6 obj_17 obj_02)
       (pred_6 obj_19 obj_03)
       (pred_8 obj_30)
    )

    (:goal (and
       (pred_6 obj_25 obj_03)
       (pred_6 obj_19 obj_16)
    ))
(:constraints
  (always (not (pred_8 obj_20)))
)
)

; plan
1. (op_5 obj_30 obj_03)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_03)
   goals met: 0 of 2
2. (op_3 obj_03 obj_19)
   deleted: (pred_6 obj_19 obj_03) (pred_11)
   added: (pred_10 obj_19)
   goals met: 0 of 2
3. (op_5 obj_03 obj_16)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_16)
   goals met: 0 of 2
4. (op_1 obj_16 obj_19)
   deleted: (pred_10 obj_19)
   added: (pred_11) (pred_6 obj_19 obj_16)
   goals met: 1 of 2
5. (op_5 obj_16 obj_03)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_03)
   goals met: 1 of 2
6. (op_5 obj_03 obj_24)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_24)
   goals met: 1 of 2
7. (op_5 obj_24 obj_10)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_10)
   goals met: 1 of 2
8. (op_5 obj_10 obj_01)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_01)
   goals met: 1 of 2
9. (op_5 obj_01 obj_27)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_27)
   goals met: 1 of 2
10. (op_5 obj_27 obj_02)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_02)
   goals met: 1 of 2
11. (op_3 obj_02 obj_25)
   deleted: (pred_6 obj_25 obj_02) (pred_11)
   added: (pred_10 obj_25)
   goals met: 1 of 2
12. (op_5 obj_02 obj_27)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_27)
   goals met: 1 of 2
13. (op_5 obj_27 obj_01)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_01)
   goals met: 1 of 2
14. (op_5 obj_01 obj_10)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_10)
   goals met: 1 of 2
15. (op_5 obj_10 obj_04)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_04)
   goals met: 1 of 2
16. (op_5 obj_04 obj_03)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_03)
   goals met: 1 of 2
17. (op_1 obj_03 obj_25)
   deleted: (pred_10 obj_25)
   added: (pred_11) (pred_6 obj_25 obj_03)
   goals met: 2 of 2
